# Ultralytics YOLOv8s model configuration
# Updated by https://github.com/ultralytics

# Parameters
nc: 2
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 3  # anchors per output layer (0 to ignore)

# YOLOv8 backbone
backbone:
  [[-1, 1, Conv, [64, 3, 2]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, C2f, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, C2f, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 6, C2f, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 3, C2f, [1024]],
   [-1, 1, SPPF, [1024, 5]]]

# YOLOv8 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C2f, [512]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C2f, [256]],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, C2f, [512]],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, C2f, [1024]],

   [[17, 20, 23], 1, Detect, [nc, [256, 512, 1024]]]]
